Revit 2026 API

# InsulationMaterial Class

---

This class represents the definition of Conductor Insulation Material data.

SystemObject Autodesk.Revit.DB.ElectricalInsulationMaterial

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class InsulationMaterial : IDisposable
```
```vb
Public Class InsulationMaterial
	Implements IDisposable
```
```cpp
public ref class InsulationMaterial : IDisposable
```
```fsharp
type InsulationMaterial =
    class
        interface IDisposable
    end
```

The InsulationMaterial type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Id | The Conductor Insulation Material id. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The Conductor Insulation Material name. |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a Conductor Insulation Material. |
|  | Dispose | Releases all resources used by the InsulationMaterial |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetInsulationMaterial | Gets the Conductor Insulation Material data by given Conductor Insulation Material id. |
|  | GetInsulationMaterialIdByName | Gets the Conductor Insulation Material id by given Conductor Insulation Material name. |
|  | GetInsulationMaterialIds | Gets all the Conductor Insulation Material ids in the given document, sorted by name. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Electrical Namespace